app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."default_city" = $1 ORDER BY "cities"."id" ASC LIMIT $2  [["default_city", true], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" ORDER BY "cities"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def clock
    @default_city = City.where(default_city: true)
    @cities = City.all

INSERT INTO "cities" ("name", "default_city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pyongyang"], ["default_city", false], ["created_at", "2020-06-12 17:31:18.034040"], ["updated_at", "2020-06-12 17:31:18.034040"]]
---
  def create
    @city = City.new(city_params)

    file = File.open "zone.json"
    @cities_data = JSON.load file
    test = city_params["name"]

    @cities_data.each do |a|
      a["utc"].each do |b|
        if b.downcase.include? test.downcase
           (@found ||= []) << a
        end
      end
   end
  file.close

  if @found.nil?
    flash.now[:danger] = 'Invalid city'
    render 'new'
  else
    respond_to do |format|
      if @city.save

UPDATE "cities" SET "default_city" = $1, "updated_at" = $2 WHERE "cities"."id" = $3  [["default_city", true], ["updated_at", "2020-06-12 02:38:46.626221"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @city.update(city_params)